Fillet cannot be created between rail segment since the radius is lower than the profile size.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RailProfileLowerThanFilletFailure { get; }
  Visual Basic
Public Shared ReadOnly Property RailProfileLowerThanFilletFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RailProfileLowerThanFilletFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace